{"<pad>": 0, "<start>": 1, "<end>": 2, "<unk>": 3, "word_map_coef": 4944, "!": 5, "@": 6, "#": 7, "$": 8, "%": 9, "^": 10, "&": 11, "*": 12, "(": 13, ")": 14, "_": 15, "+": 16, "-": 17, "=": 18, "[": 19, "]": 20, "{": 21, "}": 22, "|": 23, "\\": 24, ":": 25, ";": 26, "\u201d": 27, "\u201c": 28, "\u2018": 29, "\u2019": 30, "<": 31, ">": 32, ",": 33, ".": 34, "?": 35, "/": 36, "~": 37, "`": 38, "ques": 39, "What": 40, "is": 41, "photosynthesis": 42, "ans": 43, "Photosynthesis": 44, "the": 45, "process": 46, "by": 47, "which": 48, "plants": 49, "algae": 50, "and": 51, "some": 52, "bacteria": 53, "convert": 54, "sunlight": 55, "into": 56, "chemical": 57, "energy": 58, "Using": 59, "carbon": 60, "dioxide": 61, "water": 62, "light": 63, "these": 64, "organisms": 65, "produce": 66, "glucose": 67, "release": 68, "oxygen": 69, "as": 70, "a": 71, "byproduct": 72, "This": 73, "forms": 74, "foundation": 75, "of": 76, "most": 77, "food": 78, "chains": 79, "supplies": 80, "necessary": 81, "for": 82, "life": 83, "on": 84, "Earth": 85, "Great": 86, "Wall": 87, "China": 88, "The": 89, "series": 90, "defensive": 91, "structures": 92, "built": 93, "over": 94, "several": 95, "centuries": 96, "to": 97, "protect": 98, "Chinese": 99, "states": 100, "from": 101, "invasions": 102, "Stretching": 103, "21": 104, "000": 105, "kilometers": 106, "it": 107, "represents": 108, "one": 109, "ambitious": 110, "construction": 111, "projects": 112, "in": 113, "human": 114, "history": 115, "was": 116, "Industrial": 117, "Revolution": 118, "major": 119, "period": 120, "transformation": 121, "that": 122, "began": 123, "late": 124, "18th": 125, "century": 126, "It": 127, "marked": 128, "shift": 129, "manual": 130, "labor": 131, "machine": 132, "based": 133, "manufacturing": 134, "leading": 135, "urbanization": 136, "technological": 137, "innovation": 138, "While": 139, "increased": 140, "productivity": 141, "economic": 142, "growth": 143, "also": 144, "introduced": 145, "social": 146, "challenges": 147, "such": 148, "pollution": 149, "exploitation": 150, "gravity": 151, "Gravity": 152, "fundamental": 153, "force": 154, "nature": 155, "causes": 156, "objects": 157, "with": 158, "mass": 159, "attract": 160, "another": 161, "On": 162, "keeps": 163, "people": 164, "grounded": 165, "governs": 166, "motion": 167, "planets": 168, "moons": 169, "stars": 170, "throughout": 171, "universe": 172, "Without": 173, "structure": 174, "galaxies": 175, "planetary": 176, "systems": 177, "would": 178, "not": 179, "exist": 180, "longest": 181, "river": 182, "world": 183, "generally": 184, "considered": 185, "be": 186, "Amazon": 187, "River": 188, "South": 189, "America": 190, "flows": 191, "through": 192, "multiple": 193, "countries": 194, "including": 195, "Peru": 196, "Colombia": 197, "Brazil": 198, "stretches": 199, "approximately": 200, "6": 201, "400": 202, "powerful": 203, "volume": 204, "releasing": 205, "more": 206, "freshwater": 207, "ocean": 208, "than": 209, "any": 210, "other": 211, "system": 212, "Its": 213, "basin": 214, "supports": 215, "Rainforest": 216, "plays": 217, "vital": 218, "role": 219, "regulating": 220, "global": 221, "climate": 222, "supporting": 223, "biodiversity": 224, "artificial": 225, "intelligence": 226, "Artificial": 227, "refers": 228, "computer": 229, "designed": 230, "perform": 231, "tasks": 232, "normally": 233, "require": 234, "These": 235, "include": 236, "learning": 237, "problem": 238, "solving": 239, "language": 240, "understanding": 241, "decision": 242, "making": 243, "AI": 244, "widely": 245, "used": 246, "healthcare": 247, "finance": 248, "transportation": 249, "many": 250, "industries": 251, "largest": 252, "desert": 253, "Antarctica": 254, "classified": 255, "cold": 256, "due": 257, "its": 258, "extremely": 259, "low": 260, "precipitation": 261, "levels": 262, "Although": 263, "covered": 264, "ice": 265, "rather": 266, "sand": 267, "meets": 268, "scientific": 269, "definition": 270, "because": 271, "receives": 272, "very": 273, "little": 274, "snowfall": 275, "crucial": 276, "Earth's": 277, "currents": 278, "Internet": 279, "network": 280, "interconnected": 281, "computers": 282, "allows": 283, "share": 284, "information": 285, "communicate": 286, "instantly": 287, "has": 288, "transformed": 289, "education": 290, "business": 291, "entertainment": 292, "interaction": 293, "becoming": 294, "central": 295, "part": 296, "modern": 297, "Where": 298, "do": 299, "you": 300, "live": 301, "me": 302, "I": 303, "have": 304, "physical": 305, "location": 306, "run": 307, "servers": 308, "Please": 309, "please": 310, "You're": 311, "welcome": 312, "Is": 313, "safe": 314, "exercise": 315, "In": 316, "general": 317, "moderate": 318, "healthy": 319, "but": 320, "check": 321, "doctor": 322, "your": 323, "condition": 324, "Good": 325, "morning": 326, "Let": 327, "know": 328, "if": 329, "want": 330, "How's": 331, "going": 332, "I'm": 333, "doing": 334, "well": 335, "thanks": 336, "asking": 337, "Can": 338, "help": 339, "Yes": 340, "tell": 341, "what": 342, "need": 343, "use": 344, "hot": 345, "No": 346, "Git": 347, "version": 348, "control": 349, "tracking": 350, "code": 351, "changes": 352, "like": 353, "helping": 354, "answering": 355, "questions": 356, "Why": 357, "my": 358, "erroring": 359, "Check": 360, "error": 361, "message": 362, "line": 363, "number": 364, "paste": 365, "can": 366, "debug": 367, "Spell": 368, "word": 369, "'accommodate'": 370, "spelling": 371, "accommodate": 372, "answer": 373, "write": 374, "text": 375, "Tell": 376, "joke": 377, "Sure": 378, "did": 379, "scarecrow": 380, "win": 381, "an": 382, "award": 383, "Because": 384, "he": 385, "outstanding": 386, "his": 387, "field": 388, "Best": 389, "time": 390, "visit": 391, "Paris": 392, "Spring": 393, "autumn": 394, "are": 395, "popular": 396, "times": 397, "Do": 398, "sleep": 399, "am": 400, "available": 401, "when": 402, "send": 403, "take": 404, "medicine": 405, "professional": 406, "Who": 407, "assistant": 408, "created": 409, "Hi": 410, "Hello": 411, "How": 412, "long": 413, "boil": 414, "eggs": 415, "For": 416, "hard": 417, "boiled": 418, "9": 419, "12": 420, "minutes": 421, "adjust": 422, "size": 423, "preference": 424, "days": 425, "week": 426, "There": 427, "seven": 428, "work": 429, "patterns": 430, "generate": 431, "responses": 432, "variable": 433, "A": 434, "stores": 435, "value": 436, "later": 437, "Run": 438, "interpreter": 439, "or": 440, "compile": 441, "execute": 442, "depending": 443, "evening": 444, "symptoms": 445, "Common": 446, "runny": 447, "nose": 448, "sore": 449, "throat": 450, "cough": 451, "translate": 452, "this": 453, "target": 454, "pack": 455, "trip": 456, "Pack": 457, "essentials": 458, "clothes": 459, "chargers": 460, "documents": 461, "medicines": 462, "small": 463, "first": 464, "aid": 465, "kit": 466, "name": 467, "You": 468, "call": 469, "ChatGPT": 470, "breathe": 471, "exchange": 472, "gases": 473, "they": 474, "CO2": 475, "O2": 476, "pigs": 477, "fly": 478, "cannot": 479, "When": 480, "meeting": 481, "calendar": 482, "access": 483, "details": 484, "scheduling": 485, "made": 486, "Water": 487, "hydrogen": 488, "H2O": 489, "What's": 490, "favorite": 491, "color": 492, "don't": 493, "personal": 494, "preferences": 495, "blue": 496, "grammar": 497, "sentence": 498, "will": 499, "Could": 500, "Of": 501, "course": 502, "\u2014": 503, "cook": 504, "rice": 505, "Rinse": 506, "about": 507, "1": 508, "5": 509, "2": 510, "cups": 511, "per": 512, "cup": 513, "simmer": 514, "until": 515, "absorbed": 516, "dinner": 517, "suggest": 518, "recipes": 519, "make": 520, "tea": 521, "Boil": 522, "add": 523, "leaves": 524, "bag": 525, "steep": 526, "3": 527, "Hey": 528, "Nice": 529, "meet": 530, "tomorrow": 531, "predict": 532, "exact": 533, "future": 534, "dates": 535, "without": 536, "music": 537, "listen": 538, "talk": 539, "loop": 540, "Python": 541, "Use": 542, "i": 543, "range": 544, "n": 545, "depends": 546, "task": 547, "give": 548, "summarize": 549, "pizza": 550, "vegetarian": 551, "Some": 552, "pizzas": 553, "toppings": 554, "date": 555, "today": 556, "can't": 557, "see": 558, "current": 559, "chat": 560, "device": 561, "there": 562, "plus": 563, "equals": 564, "4": 565, "list": 566, "topic": 567, "how": 568, "items": 569, "install": 570, "package": 571, "manager": 572, "pip": 573, "Are": 574, "plural": 575, "mouse": 576, "mice": 577, "feelings": 578, "simulate": 579, "empathy": 580, "Thanks": 581, "Happy": 582, "up": 583, "Not": 584, "much": 585, "watch": 586, "movies": 587, "films": 588, "hotel": 589, "hotels": 590, "budget": 591, "city": 592, "fire": 593, "get": 594, "airport": 595, "local": 596, "transport": 597, "taxi": 598, "transfer": 599, "options": 600, "sky": 601, "often": 602, "appears": 603, "during": 604, "day": 605, "learn": 606, "individual": 607, "chats": 608, "improved": 609, "developers": 610, "drink": 611, "common": 612, "guideline": 613, "liters": 614, "needs": 615, "vary": 616, "solve": 617, "math": 618, "try": 619, "Would": 620, "mind": 621, "at": 622, "all": 623, "assist": 624, "real": 625, "clock": 626, "appreciate": 627, "Glad": 628, "could": 629, "flight": 630, "London": 631, "Flight": 632, "varies": 633, "origin": 634, "departure": 635, "estimate": 636, "hobbies": 637, "eat": 638, "fish": 639, "while": 640, "pregnant": 641, "Consult": 642, "provider": 643, "pregnancy": 644, "specific": 645, "advice": 646, "capital": 647, "France": 648, "Thank": 649, "passport": 650, "If": 651, "traveling": 652, "internationally": 653, "usually": 654, "fine": 655, "thank": 656, "school": 657, "assignment": 658, "simple": 659, "provide": 660, "links": 661, "references": 662, "explore": 663, "further": 664, "own": 665, "Here": 666, "longer": 667, "explanation": 668, "understand": 669, "reasoning": 670, "context": 671, "behind": 672, "step": 673, "It's": 674, "turn": 675, "preparing": 676, "Give": 677, "examples": 678, "possible": 679, "short": 680, "clear": 681, "Maybe": 682, "concise": 683, "Clothes": 684, "here": 685, "should": 686, "using": 687, "models": 688, "Generally": 689, "yes": 690, "consult": 691, "9\u201312": 692, "you'd": 693, "break": 694, "down": 695, "each": 696, "clearer": 697, "show": 698, "Seven": 699, "Okay": 700, "Usually": 701, "international": 702, "travel": 703, "sure": 704, "He": 705, "Paste": 706, "I'll": 707, "shorten": 708, "Take": 709, "schedules": 710, "rapid": 711, "industrial": 712, "change": 713, "beginning": 714, "factories": 715, "environmental": 716, "communication": 717, "connecting": 718, "billions": 719, "devices": 720, "worldwide": 721, "enables": 722, "instant": 723, "machines": 724, "data": 725, "recognize": 726, "decisions": 727, "playing": 728, "growing": 729, "technology": 730, "industry": 731, "Beyond": 732, "length": 733, "carries": 734, "important": 735, "ecosystems": 736, "regulation": 737, "vast": 738, "stands": 739, "symbol": 740, "historical": 741, "engineering": 742, "achievement": 743, "Despite": 744, "being": 745, "temperature": 746, "circulation": 747, "attracts": 748, "toward": 749, "together": 750, "holding": 751, "atmosphere": 752, "oceans": 753, "place": 754, "correct": 755, "implementation": 756, "python": 757, "working": 758, "solution": 759, "Write": 760, "function": 761, "reverses": 762, "string": 763, "returns": 764, "reversed": 765, "Include": 766, "example": 767, "usage": 768, "Explanation": 769, "new": 770, "reverse": 771, "input": 772, "handles": 773, "Unicode": 774, "correctly": 775, "Python's": 776, "slicing": 777, "works": 778, "points": 779, "def": 780, "s": 781, "str": 782, "return": 783, "\"": 784, "main": 785, "print": 786, "\"hello\"": 787, "output": 788, "'olleh'": 789, "cpp": 790, "compute": 791, "factorial": 792, "non": 793, "negative": 794, "integer": 795, "iterative": 796, "Iterative": 797, "64": 798, "bit": 799, "integers": 800, "bits": 801, "stdc": 802, "h": 803, "namespace": 804, "std": 805, "int": 806, "0": 807, "throw": 808, "invalid": 809, "argument": 810, "\"n": 811, "must": 812, "negative\"": 813, "res": 814, "cout": 815, "'": 816, "n'": 817, "120": 818, "javascript": 819, "Fibonacci": 820, "numbers": 821, "array": 822, "Generate": 823, "fibonacci": 824, "const": 825, "seq": 826, "push": 827, "console": 828, "log": 829, "10": 830, "java": 831, "binary": 832, "search": 833, "searches": 834, "sorted": 835, "index": 836, "found": 837, "Binary": 838, "public": 839, "class": 840, "Main": 841, "static": 842, "binarySearch": 843, "lo": 844, "hi": 845, "mid": 846, "else": 847, "void": 848, "String": 849, "args": 850, "System": 851, "out": 852, "println": 853, "go": 854, "merges": 855, "two": 856, "arrays": 857, "single": 858, "Merge": 859, "slices": 860, "import": 861, "\"fmt\"": 862, "func": 863, "mergeSorted": 864, "b": 865, "j": 866, "len": 867, "append": 868, "fmt": 869, "Println": 870, "Implement": 871, "quicksort": 872, "sort": 873, "Lomuto": 874, "partition": 875, "typing": 876, "List": 877, "arr": 878, "None": 879, "p": 880, "pivot": 881, "8": 882, "checks": 883, "whether": 884, "given": 885, "palindrome": 886, "ignoring": 887, "alphanumerics": 888, "case": 889, "Normalize": 890, "keeping": 891, "compare": 892, "forwards": 893, "backwards": 894, "bool": 895, "t": 896, "char": 897, "c": 898, "isalnum": 899, "unsigned": 900, "back": 901, "tolower": 902, "false": 903, "true": 904, "\"A": 905, "man": 906, "plan": 907, "canal": 908, "Panama\"": 909, "prime": 910, "efficient": 911, "Trial": 912, "division": 913, "sqrt": 914, "isPrime": 915, "r": 916, "Math": 917, "floor": 918, "let": 919, "97": 920, "Sieve": 921, "Eratosthenes": 922, "primes": 923, "boolean": 924, "util": 925, "Integer": 926, "sieve": 927, "ArrayList": 928, "Arrays": 929, "fill": 930, "m": 931, "30": 932, "program": 933, "reads": 934, "file": 935, "counts": 936, "frequencies": 937, "printing": 938, "top": 939, "words": 940, "Read": 941, "count": 942, "bufio": 943, "Scanner": 944, "\"bufio\"": 945, "\"os\"": 946, "\"regexp\"": 947, "\"sort\"": 948, "os": 949, "Args": 950, "\"usage": 951, "prog": 952, "file\"": 953, "f": 954, "Open": 955, "defer": 956, "Close": 957, "scanner": 958, "NewScanner": 959, "Split": 960, "ScanWords": 961, "re": 962, "regexp": 963, "MustCompile": 964, "w": 965, "b\"": 966, "map": 967, "Seek": 968, "Scan": 969, "Text": 970, "type": 971, "kv": 972, "struct": 973, "k": 974, "v": 975, "var": 976, "Slice": 977, "minimal": 978, "HTTP": 979, "server": 980, "responds": 981, "'Hello": 982, "GET": 983, "request": 984, "Minimal": 985, "http": 986, "module": 987, "BaseHTTPRequestHandler": 988, "HTTPServer": 989, "SimpleHandler": 990, "self": 991, "response": 992, "200": 993, "header": 994, "'Content": 995, "type'": 996, "'text": 997, "plain": 998, "charset": 999, "utf": 1000, "8'": 1001, "end": 1002, "headers": 1003, "wfile": 1004, "b'Hello": 1005, "'127": 1006, "1'": 1007, "8000": 1008, "'Serving": 1009, "127": 1010, "8000'": 1011, "serve": 1012, "forever": 1013, "except": 1014, "KeyboardInterrupt": 1015, "close": 1016, "CSV": 1017, "parser": 1018, "rows": 1019, "row": 1020, "fields": 1021, "Very": 1022, "handling": 1023, "quoted": 1024, "vector": 1025, "parse": 1026, "csv": 1027, "cur": 1028, "quotes": 1029, "'\"'": 1030, "r'": 1031, "empty": 1032, "auto": 1033, "\"name": 1034, "age": 1035, "\"Doe": 1036, "John": 1037, "30\"": 1038, "n\"": 1039, "flattens": 1040, "nested": 1041, "arbitrary": 1042, "nesting": 1043, "level": 1044, "Flatten": 1045, "recursively": 1046, "flatten": 1047, "dfs": 1048, "x": 1049, "Array": 1050, "isArray": 1051, "7": 1052, "JavaScript": 1053, "debounce": 1054, "delays": 1055, "invoking": 1056, "specified": 1057, "wait": 1058, "passed": 1059, "since": 1060, "last": 1061, "Debounce": 1062, "included": 1063, "Java": 1064, "Stack": 1065, "pop": 1066, "peek": 1067, "isEmpty": 1068, "methods": 1069, "slice": 1070, "Push": 1071, "Pop": 1072, "panic": 1073, "\"empty\"": 1074, "Peek": 1075, "IsEmpty": 1076, "queue": 1077, "stacks": 1078, "enqueue": 1079, "dequeue": 1080, "operations": 1081, "Queue": 1082, "implemented": 1083, "lists": 1084, "amortized": 1085, "O": 1086, "QueueTwoStacks": 1087, "init": 1088, "move": 1089, "raise": 1090, "IndexError": 1091, "'dequeue": 1092, "queue'": 1093, "q": 1094, "Given": 1095, "tree": 1096, "node": 1097, "implement": 1098, "inorder": 1099, "traversal": 1100, "recursive": 1101, "Basic": 1102, "Node": 1103, "val": 1104, "left": 1105, "right": 1106, "NULL": 1107, "rec": 1108, "iter": 1109, "root": 1110, "stack": 1111, "st": 1112, "o": 1113, "o2": 1114, "merge": 1115, "overlapping": 1116, "intervals": 1117, "pairs": 1118, "start": 1119, "after": 1120, "sorting": 1121, "mergeIntervals": 1122, "max": 1123, "Return": 1124, "unique": 1125, "elements": 1126, "preserving": 1127, "occurrence": 1128, "order": 1129, "Preserve": 1130, "LinkedHashSet": 1131, "set": 1132, "uniquePreserve": 1133, "Set": 1134, "seen": 1135, "HashSet": 1136, "contains": 1137, "asList": 1138, "Rotate": 1139, "steps": 1140, "rotateRight": 1141, "\u0410\u043d\u0442\u043e\u043d\u0438\u043c": 1142, "\u043a": 1143, "\u0441\u043b\u043e\u0432\u0443": 1144, "'\u0442\u0451\u043f\u043b\u044b\u0439'": 1145, "\u0445\u043e\u043b\u043e\u0434\u043d\u044b\u0439": 1146, "\u0427\u0442\u043e": 1147, "\u0442\u0430\u043a\u043e\u0435": 1148, "'\u0442\u0435\u043b\u0435\u0444\u043e\u043d'": 1149, "\u0443\u0441\u0442\u0440\u043e\u0439\u0441\u0442\u0432\u043e": 1150, "\u0434\u043b\u044f": 1151, "\u0433\u043e\u043b\u043e\u0441\u043e\u0432\u043e\u0439": 1152, "\u0438": 1153, "\u0446\u0438\u0444\u0440\u043e\u0432\u043e\u0439": 1154, "\u0441\u0432\u044f\u0437\u0438": 1155, "\u0421\u043a\u043e\u043b\u044c\u043a\u043e": 1156, "\u0431\u0443\u0434\u0435\u0442": 1157, "754": 1158, "104": 1159, "858": 1160, "'\u0434\u0435\u043d\u044c'": 1161, "\u043d\u043e\u0447\u044c": 1162, "432": 1163, "32": 1164, "464": 1165, "223": 1166, "238": 1167, "461": 1168, "\u0421\u0438\u043d\u043e\u043d\u0438\u043c": 1169, "'\u0431\u044b\u0441\u0442\u0440\u044b\u0439'": 1170, "\u0441\u043a\u043e\u0440\u044b\u0439": 1171, "'\u0441\u0447\u0430\u0441\u0442\u043b\u0438\u0432\u044b\u0439'": 1172, "\u0440\u0430\u0434\u043e\u0441\u0442\u043d\u044b\u0439": 1173, "57": 1174, "75": 1175, "4275": 1176, "890": 1177, "896": 1178, "'\u0442\u044f\u0436\u0451\u043b\u044b\u0439'": 1179, "\u043b\u0451\u0433\u043a\u0438\u0439": 1180, "220": 1181, "980": 1182, "1200": 1183, "'\u043a\u043e\u043c\u043f\u044c\u044e\u0442\u0435\u0440'": 1184, "\u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0438": 1185, "\u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0438": 1186, "99": 1187, "367": 1188, "466": 1189, "\u041f\u0435\u0440\u0435\u0432\u0435\u0434\u0438": 1190, "\u043d\u0430": 1191, "\u0440\u0443\u0441\u0441\u043a\u0438\u0439": 1192, "'city'": 1193, "\u0433\u043e\u0440\u043e\u0434": 1194, "44": 1195, "747": 1196, "791": 1197, "15": 1198, "48": 1199, "720": 1200, "300": 1201, "849": 1202, "1149": 1203, "233": 1204, "1024": 1205, "29": 1206, "290": 1207, "'tree'": 1208, "\u0434\u0435\u0440\u0435\u0432\u043e": 1209, "650": 1210, "854": 1211, "1504": 1212, "47": 1213, "45": 1214, "2115": 1215, "273": 1216, "718": 1217, "991": 1218, "\u0431\u0443\u043a\u0432": 1219, "\u0432": 1220, "\u0441\u043b\u043e\u0432\u0435": 1221, "'\u043a\u043e\u0448\u043a\u0430'": 1222, "'\u043c\u0435\u0434\u043b\u0435\u043d\u043d\u044b\u0439'": 1223, "\u043d\u0435\u0442\u043e\u0440\u043e\u043f\u043b\u0438\u0432\u044b\u0439": 1224, "388": 1225, "276": 1226, "664": 1227, "'\u044f\u0431\u043b\u043e\u043a\u043e'": 1228, "332": 1229, "863": 1230, "1195": 1231, "824": 1232, "856": 1233, "34": 1234, "272": 1235, "965": 1236, "580": 1237, "1545": 1238, "'book'": 1239, "\u043a\u043d\u0438\u0433\u0430": 1240, "511": 1241, "405": 1242, "916": 1243, "'home'": 1244, "\u0434\u043e\u043c": 1245, "142": 1246, "252": 1247, "394": 1248, "'\u043b\u0435\u0441'": 1249, "\u043e\u0431\u0448\u0438\u0440\u043d\u0430\u044f": 1250, "\u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u044f": 1251, "\u043f\u043e\u043a\u0440\u044b\u0442\u0430\u044f": 1252, "\u0434\u0435\u0440\u0435\u0432\u044c\u044f\u043c\u0438": 1253, "598": 1254, "438": 1255, "1036": 1256, "17": 1257, "65": 1258, "1105": 1259, "'cat'": 1260, "\u043a\u043e\u0442": 1261, "'\u0441\u0438\u043b\u044c\u043d\u044b\u0439'": 1262, "\u0441\u043b\u0430\u0431\u044b\u0439": 1263, "'\u043c\u0430\u043b\u0435\u043d\u044c\u043a\u0438\u0439'": 1264, "\u043a\u0440\u043e\u0448\u0435\u0447\u043d\u044b\u0439": 1265, "59": 1266, "67": 1267, "3953": 1268, "566": 1269, "881": 1270, "1447": 1271, "'\u0440\u0435\u043a\u0430'": 1272, "\u0431\u043e\u043b\u044c\u0448\u043e\u0439": 1273, "\u043f\u043e\u0442\u043e\u043a": 1274, "\u0432\u043e\u0434\u044b": 1275, "\u0442\u0435\u043a\u0443\u0449\u0438\u0439": 1276, "\u0440\u0443\u0441\u043b\u0435": 1277, "445": 1278, "161": 1279, "606": 1280, "92": 1281, "8464": 1282, "512": 1283, "780": 1284, "1292": 1285, "934": 1286, "108": 1287, "1042": 1288, "'apple'": 1289, "\u044f\u0431\u043b\u043e\u043a\u043e": 1290, "'car'": 1291, "\u043c\u0430\u0448\u0438\u043d\u0430": 1292, "20": 1293, "69": 1294, "1380": 1295, "'\u043c\u0430\u0448\u0438\u043d\u0430'": 1296, "14": 1297, "28": 1298, "246": 1299, "899": 1300, "1145": 1301, "497": 1302, "835": 1303, "1332": 1304, "778": 1305, "545": 1306, "1323": 1307, "540": 1308, "893": 1309, "1433": 1310, "'\u0434\u0435\u0440\u0435\u0432\u043e'": 1311, "'\u0433\u043e\u0440\u043e\u0434'": 1312, "66": 1313, "3762": 1314, "230": 1315, "295": 1316, "70": 1317, "5250": 1318, "225": 1319, "232": 1320, "646": 1321, "60": 1322, "706": 1323, "927": 1324, "959": 1325, "'world'": 1326, "\u043c\u0438\u0440": 1327, "'\u0431\u043e\u043b\u044c\u0448\u043e\u0439'": 1328, "\u043e\u0433\u0440\u043e\u043c\u043d\u044b\u0439": 1329, "'\u0432\u044b\u0441\u043e\u043a\u0438\u0439'": 1330, "\u043d\u0438\u0437\u043a\u0438\u0439": 1331, "'\u0433\u043e\u0440\u0430'": 1332, "\u0432\u043e\u0437\u0432\u044b\u0448\u0435\u043d\u043d\u043e\u0441\u0442\u044c": 1333, "\u0441": 1334, "\u043a\u0440\u0443\u0442\u044b\u043c\u0438": 1335, "\u0441\u043a\u043b\u043e\u043d\u0430\u043c\u0438": 1336, "674": 1337, "773": 1338, "54": 1339, "52": 1340, "2808": 1341, "93": 1342, "558": 1343, "745": 1344, "347": 1345, "1092": 1346, "194": 1347, "549": 1348, "743": 1349, "23": 1350, "1242": 1351, "255": 1352, "895": 1353, "1150": 1354, "'\u0441\u0442\u043e\u043b'": 1355, "667": 1356, "553": 1357, "1220": 1358, "492": 1359, "989": 1360, "410": 1361, "924": 1362, "1334": 1363, "390": 1364, "89": 1365, "8277": 1366, "303": 1367, "222": 1368, "525": 1369, "488": 1370, "514": 1371, "1002": 1372, "983": 1373, "520": 1374, "1503": 1375, "190": 1376, "260": 1377, "72": 1378, "31": 1379, "2232": 1380, "733": 1381, "321": 1382, "1054": 1383, "134": 1384, "539": 1385, "96": 1386, "864": 1387, "636": 1388, "576": 1389, "1212": 1390, "955": 1391, "357": 1392, "1312": 1393, "'dog'": 1394, "\u0441\u043e\u0431\u0430\u043a\u0430": 1395, "56": 1396, "1120": 1397, "836": 1398, "567": 1399, "1403": 1400, "84": 1401, "13": 1402, "'\u0441\u043e\u0431\u0430\u043a\u0430'": 1403, "911": 1404, "109": 1405, "1020": 1406, "619": 1407, "215": 1408, "834": 1409, "'\u0434\u043e\u043c'": 1410, "433": 1411, "1282": 1412, "341": 1413, "344": 1414, "452": 1415, "564": 1416, "1016": 1417, "77": 1418, "967": 1419, "1044": 1420, "39": 1421, "195": 1422, "682": 1423, "937": 1424, "798": 1425, "573": 1426, "1371": 1427, "'hello'": 1428, "\u043f\u0440\u0438\u0432\u0435\u0442": 1429, "946": 1430, "340": 1431, "1286": 1432, "806": 1433, "1524": 1434, "932": 1435, "940": 1436, "471": 1437, "1411": 1438, "812": 1439, "197": 1440, "408": 1441, "605": 1442, "98": 1443, "784": 1444, "656": 1445, "521": 1446, "1177": 1447, "68": 1448, "42": 1449, "2856": 1450, "985": 1451, "271": 1452, "1256": 1453, "610": 1454, "444": 1455, "40": 1456, "55": 1457, "2200": 1458, "921": 1459, "590": 1460, "1511": 1461, "725": 1462, "770": 1463, "4488": 1464, "85": 1465, "680": 1466, "41": 1467, "2132": 1468, "37": 1469, "2590": 1470, "430": 1471, "1110": 1472, "38": 1473, "74": 1474, "4070": 1475, "86": 1476, "4816": 1477, "484": 1478, "1296": 1479, "2880": 1480, "250": 1481, "486": 1482, "736": 1483, "80": 1484, "73": 1485, "5840": 1486, "713": 1487, "393": 1488, "1106": 1489, "704": 1490, "709": 1491, "712": 1492, "1692": 1493, "5015": 1494, "3990": 1495, "2976": 1496, "79": 1497, "730": 1498, "809": 1499, "1428": 1500, "690": 1501, "236": 1502, "392": 1503, "628": 1504, "417": 1505, "338": 1506, "755": 1507, "852": 1508, "7252": 1509, "49": 1510, "53": 1511, "2597": 1512, "147": 1513, "51": 1514, "4386": 1515, "138": 1516, "335": 1517, "723": 1518, "334": 1519, "345": 1520, "679": 1521, "974": 1522, "851": 1523, "1825": 1524, "600": 1525, "552": 1526, "799": 1527, "869": 1528, "129": 1529, "613": 1530, "621": 1531, "986": 1532, "1607": 1533, "91": 1534, "25": 1535, "2275": 1536, "707": 1537, "850": 1538, "1557": 1539, "663": 1540, "349": 1541, "1012": 1542, "842": 1543, "1272": 1544, "534": 1545, "988": 1546, "1522": 1547, "6975": 1548, "872": 1549, "251": 1550, "1123": 1551, "249": 1552, "710": 1553, "63": 1554, "2583": 1555, "217": 1556, "363": 1557, "1328": 1558, "970": 1559, "1165": 1560, "737": 1561, "416": 1562, "1153": 1563, "11": 1564, "22": 1565, "88": 1566, "595": 1567, "1274": 1568, "4690": 1569, "95": 1570, "6650": 1571, "58": 1572, "5162": 1573, "257": 1574, "493": 1575, "323": 1576, "548": 1577, "973": 1578, "1521": 1579, "756": 1580, "495": 1581, "1251": 1582, "603": 1583, "1381": 1584, "46": 1585, "90": 1586, "6120": 1587, "997": 1588, "1043": 1589, "299": 1590, "714": 1591, "1013": 1592, "587": 1593, "599": 1594, "61": 1595, "3416": 1596, "192": 1597, "476": 1598, "830": 1599, "1406": 1600, "535": 1601, "389": 1602, "2128": 1603, "565": 1604, "76": 1605, "641": 1606, "418": 1607, "879": 1608, "36": 1609, "239": 1610, "1185": 1611, "810": 1612, "640": 1613, "1450": 1614, "1932": 1615, "811": 1616, "314": 1617, "1125": 1618, "705": 1619, "311": 1620, "380": 1621, "984": 1622, "1674": 1623, "83": 1624, "4648": 1625, "'\u043a\u043d\u0438\u0433\u0430'": 1626, "1722": 1627, "5544": 1628, "4947": 1629, "258": 1630, "331": 1631, "589": 1632, "413": 1633, "1204": 1634, "24": 1635, "144": 1636, "949": 1637, "1083": 1638, "62": 1639, "5518": 1640, "996": 1641, "645": 1642, "1641": 1643, "82": 1644, "1230": 1645, "3660": 1646, "148": 1647, "4940": 1648, "2176": 1649, "6693": 1650, "762": 1651, "1246": 1652, "6972": 1653, "672": 1654, "467": 1655, "1399": 1656, "419": 1657, "800": 1658, "992": 1659, "1792": 1660, "638": 1661, "1347": 1662, "420": 1663, "3200": 1664, "1164": 1665, "3344": 1666, "259": 1667, "18": 1668, "990": 1669, "421": 1670, "579": 1671, "1000": 1672, "624": 1673, "653": 1674, "913": 1675, "1419": 1676, "2850": 1677, "585": 1678, "975": 1679, "3293": 1680, "50": 1681, "4200": 1682, "885": 1683, "1464": 1684, "635": 1685, "829": 1686, "738": 1687, "224": 1688, "302": 1689, "805": 1690, "1357": 1691, "126": 1692, "465": 1693, "591": 1694, "8170": 1695, "1232": 1696, "482": 1697, "721": 1698, "905": 1699, "1870": 1700, "968": 1701, "1006": 1702, "882": 1703, "908": 1704, "550": 1705, "1458": 1706, "379": 1707, "843": 1708, "8835": 1709, "424": 1710, "670": 1711, "1094": 1712, "501": 1713, "630": 1714, "1131": 1715, "35": 1716, "140": 1717, "702": 1718, "376": 1719, "1078": 1720, "282": 1721, "657": 1722, "874": 1723, "783": 1724, "1632": 1725, "1128": 1726, "1368": 1727, "1027": 1728, "178": 1729, "112": 1730, "366": 1731, "808": 1732, "1174": 1733, "33": 1734, "726": 1735, "759": 1736, "431": 1737, "1190": 1738, "4554": 1739, "78": 1740, "2184": 1741, "802": 1742, "930": 1743, "1732": 1744, "490": 1745, "867": 1746, "87": 1747, "329": 1748, "411": 1749, "639": 1750, "648": 1751, "1287": 1752, "5092": 1753, "4928": 1754, "1508": 1755, "2958": 1756, "480": 1757, "2720": 1758, "19": 1759, "1653": 1760, "182": 1761, "94": 1762, "8930": 1763, "16": 1764, "71": 1765, "1136": 1766, "979": 1767, "575": 1768, "1554": 1769, "8160": 1770, "285": 1771, "439": 1772, "865": 1773, "1304": 1774, "951": 1775, "673": 1776, "1624": 1777, "279": 1778, "719": 1779, "998": 1780, "414": 1781, "758": 1782, "43": 1783, "2494": 1784, "319": 1785, "1057": 1786, "5472": 1787, "159": 1788, "212": 1789, "632": 1790, "3348": 1791, "524": 1792, "1297": 1793, "440": 1794, "113": 1795, "6450": 1796, "404": 1797, "1017": 1798, "209": 1799, "308": 1800, "517": 1801, "1265": 1802, "572": 1803, "853": 1804, "1425": 1805, "470": 1806, "489": 1807, "81": 1808, "4293": 1809, "102": 1810, "4048": 1811, "972": 1812, "797": 1813, "172": 1814, "969": 1815, "116": 1816, "764": 1817, "1476": 1818, "149": 1819, "262": 1820, "616": 1821, "156": 1822, "772": 1823, "643": 1824, "1434": 1825, "1330": 1826, "324": 1827, "5180": 1828, "6059": 1829, "487": 1830, "3913": 1831, "661": 1832, "176": 1833, "837": 1834, "724": 1835, "448": 1836, "1172": 1837, "1764": 1838, "3698": 1839, "571": 1840, "1544": 1841, "823": 1842, "960": 1843, "1685": 1844, "385": 1845, "957": 1846, "686": 1847, "1119": 1848, "27": 1849, "6076": 1850, "158": 1851, "298": 1852, "807": 1853, "1671": 1854, "789": 1855, "1341": 1856, "897": 1857, "1241": 1858, "1560": 1859, "7912": 1860, "454": 1861, "625": 1862, "1079": 1863, "5415": 1864, "244": 1865, "316": 1866, "560": 1867, "4088": 1868, "3564": 1869, "3551": 1870, "164": 1871, "443": 1872, "1170": 1873, "382": 1874, "383": 1875, "326": 1876, "953": 1877, "1279": 1878, "731": 1879, "665": 1880, "1396": 1881, "306": 1882, "939": 1883, "1788": 1884, "1649": 1885, "855": 1886, "1075": 1887, "962": 1888, "744": 1889, "1706": 1890, "243": 1891, "538": 1892, "180": 1893, "4582": 1894, "926": 1895, "1782": 1896, "527": 1897, "588": 1898, "1115": 1899, "3510": 1900, "426": 1901, "191": 1902, "617": 1903, "557": 1904, "1095": 1905, "365": 1906, "381": 1907, "1315": 1908, "752": 1909, "559": 1910, "346": 1911, "794": 1912, "966": 1913, "1760": 1914, "925": 1915, "204": 1916, "907": 1917, "1111": 1918, "317": 1919, "384": 1920, "594": 1921, "818": 1922, "1194": 1923, "4845": 1924, "2107": 1925, "828": 1926, "4235": 1927, "676": 1928, "1011": 1929, "4389": 1930, "4185": 1931, "1780": 1932, "687": 1933, "652": 1934, "1339": 1935, "6175": 1936, "622": 1937, "694": 1938, "1316": 1939, "241": 1940, "1038": 1941, "288": 1942, "375": 1943, "407": 1944, "782": 1945, "1085": 1946, "793": 1947, "266": 1948, "1059": 1949, "873": 1950, "920": 1951, "1096": 1952, "205": 1953, "505": 1954, "1314": 1955, "586": 1956, "734": 1957, "1141": 1958, "3796": 1959, "995": 1960, "1319": 1961, "2904": 1962, "848": 1963, "1646": 1964, "132": 1965, "1121": 1966, "105": 1967, "330": 1968, "1629": 1969, "1376": 1970, "884": 1971, "971": 1972, "1627": 1973, "2318": 1974, "826": 1975, "701": 1976, "1527": 1977, "522": 1978, "3599": 1979, "768": 1980, "3640": 1981, "125": 1982, "398": 1983, "216": 1984, "1361": 1985, "886": 1986, "923": 1987, "1809": 1988, "956": 1989, "1291": 1990, "163": 1991, "510": 1992, "506": 1993, "611": 1994, "1117": 1995, "3069": 1996, "2346": 1997, "583": 1998, "5529": 1999, "403": 2000, "502": 2001, "3053": 2002, "1071": 2003, "5005": 2004, "627": 2005, "1580": 2006, "3900": 2007, "742": 2008, "697": 2009, "248": 2010, "945": 2011, "717": 2012, "1687": 2013, "451": 2014, "678": 2015, "1010": 2016, "1920": 2017, "3124": 2018, "6278": 2019, "3276": 2020, "1398": 2021, "847": 2022, "551": 2023, "111": 2024, "741": 2025, "685": 2026, "1611": 2027, "423": 2028, "761": 2029, "563": 2030, "1514": 2031, "668": 2032, "1625": 2033, "2400": 2034, "237": 2035, "1001": 2036, "5658": 2037, "115": 2038, "943": 2039, "5394": 2040, "1154": 2041, "8256": 2042, "876": 2043, "1501": 2044, "4335": 2045, "143": 2046, "631": 2047, "457": 2048, "698": 2049, "6716": 2050, "669": 2051, "368": 2052, "1037": 2053, "4437": 2054, "765": 2055, "620": 2056, "1385": 2057, "6230": 2058, "1484": 2059, "3696": 2060, "210": 2061, "944": 2062, "425": 2063, "892": 2064, "3588": 2065, "592": 2066, "815": 2067, "352": 2068, "785": 2069, "184": 2070, "602": 2071, "2736": 2072, "7308": 2073, "402": 2074, "952": 2075, "1392": 2076, "354": 2077, "1855": 2078, "429": 2079, "103": 2080, "171": 2081, "456": 2082, "1863": 2083, "296": 2084, "7448": 2085, "146": 2086, "307": 2087, "281": 2088, "1576": 2089, "188": 2090, "537": 2091, "26": 2092, "832": 2093, "570": 2094, "386": 2095, "689": 2096, "213": 2097, "1103": 2098, "1179": 2099, "1728": 2100, "3735": 2101, "2990": 2102, "739": 2103, "1219": 2104, "360": 2105, "1523": 2106, "1050": 2107, "1436": 2108, "1233": 2109, "841": 2110, "500": 2111, "154": 2112, "1335": 2113, "542": 2114, "1281": 2115, "293": 2116, "310": 2117, "536": 2118, "634": 2119, "196": 2120, "406": 2121, "774": 2122, "1309": 2123, "922": 2124, "888": 2125, "1810": 2126, "601": 2127, "813": 2128, "840": 2129, "729": 2130, "1569": 2131, "2160": 2132, "9024": 2133, "1446": 2134, "763": 2135, "660": 2136, "348": 2137, "1081": 2138, "963": 2139, "1529": 2140, "2001": 2141, "633": 2142, "935": 2143, "157": 2144, "546": 2145, "442": 2146, "441": 2147, "4615": 2148, "4851": 2149, "1494": 2150, "274": 2151, "582": 2152, "4565": 2153, "6776": 2154, "181": 2155, "7128": 2156, "2300": 2157, "577": 2158, "781": 2159, "786": 2160, "1349": 2161, "472": 2162, "1216": 2163, "3256": 2164, "868": 2165, "814": 2166, "1682": 2167, "247": 2168, "732": 2169, "889": 2170, "4636": 2171, "254": 2172, "100": 2173, "264": 2174, "364": 2175, "531": 2176, "1295": 2177, "183": 2178, "942": 2179, "1367": 2180, "1452": 2181, "304": 2182, "727": 2183, "117": 2184, "844": 2185, "351": 2186, "1014": 2187, "819": 2188, "168": 2189, "987": 2190, "436": 2191, "1009": 2192, "7332": 2193, "219": 2194, "1548": 2195, "1441": 2196, "333": 2197, "201": 2198, "2805": 2199, "722": 2200, "397": 2201, "428": 2202, "825": 2203, "1426": 2204, "139": 2205, "199": 2206, "3286": 2207, "1518": 2208, "1485": 2209, "3330": 2210, "2210": 2211, "804": 2212, "1572": 2213, "245": 2214, "728": 2215, "3325": 2216, "2542": 2217, "1443": 2218, "878": 2219, "1039": 2220, "931": 2221, "1636": 2222, "309": 2223, "1852": 2224, "369": 2225, "1060": 2226, "312": 2227, "218": 2228, "607": 2229, "231": 2230, "838": 2231, "1063": 2232, "483": 2233, "902": 2234, "1278": 2235, "4752": 2236, "584": 2237, "2484": 2238, "1142": 2239, "401": 2240, "703": 2241, "608": 2242, "1261": 2243, "910": 2244, "859": 2245, "1740": 2246, "1215": 2247, "523": 2248, "5115": 2249, "1034": 2250, "4524": 2251, "767": 2252, "1836": 2253, "322": 2254, "261": 2255, "422": 2256, "883": 2257, "372": 2258, "5504": 2259, "528": 2260, "4060": 2261, "503": 2262, "4725": 2263, "954": 2264, "1373": 2265, "554": 2266, "918": 2267, "1155": 2268, "950": 2269, "839": 2270, "581": 2271, "644": 2272, "2000": 2273, "207": 2274, "2080": 2275, "1353": 2276, "1528": 2277, "8010": 2278, "982": 2279, "473": 2280, "1253": 2281, "6560": 2282, "265": 2283, "202": 2284, "268": 2285, "964": 2286, "1533": 2287, "4600": 2288, "904": 2289, "152": 2290, "1056": 2291, "4270": 2292, "286": 2293, "658": 2294, "862": 2295, "821": 2296, "556": 2297, "1377": 2298, "2728": 2299, "4020": 2300, "2146": 2301, "518": 2302, "325": 2303, "1163": 2304, "1950": 2305, "151": 2306, "751": 2307, "8184": 2308, "2046": 2309, "1689": 2310, "941": 2311, "106": 2312, "270": 2313, "358": 2314, "427": 2315, "110": 2316, "395": 2317, "267": 2318, "350": 2319, "174": 2320, "4758": 2321, "339": 2322, "3108": 2323, "211": 2324, "396": 2325, "906": 2326, "269": 2327, "275": 2328, "1483": 2329, "7200": 2330, "860": 2331, "3498": 2332, "775": 2333, "1747": 2334, "699": 2335, "779": 2336, "1440": 2337, "569": 2338, "153": 2339, "4526": 2340, "412": 2341, "900": 2342, "1482": 2343, "1758": 2344, "1394": 2345, "4888": 2346, "1244": 2347, "6633": 2348, "1748": 2349, "875": 2350, "3776": 2351, "1305": 2352, "3135": 2353, "294": 2354, "1383": 2355, "1789": 2356, "820": 2357, "2112": 2358, "1593": 2359, "5214": 2360, "283": 2361, "655": 2362, "938": 2363, "529": 2364, "3480": 2365, "671": 2366, "3705": 2367, "1974": 2368, "301": 2369, "474": 2370, "649": 2371, "597": 2372, "1109": 2373, "1028": 2374, "555": 2375, "4176": 2376, "1615": 2377, "499": 2378, "880": 2379, "2522": 2380, "3294": 2381, "1354": 2382, "1104": 2383, "637": 2384, "2790": 2385, "229": 2386, "2592": 2387, "677": 2388, "118": 2389, "544": 2390, "1107": 2391, "532": 2392, "845": 2393, "796": 2394, "1531": 2395, "1139": 2396, "1221": 2397, "3440": 2398, "141": 2399, "4424": 2400, "750": 2401, "409": 2402, "4312": 2403, "1455": 2404, "1829": 2405, "933": 2406, "1359": 2407, "7740": 2408, "1421": 2409, "1033": 2410, "846": 2411, "1417": 2412, "1614": 2413, "328": 2414, "831": 2415, "993": 2416, "284": 2417, "1277": 2418, "228": 2419, "4161": 2420, "5985": 2421, "227": 2422, "901": 2423, "760": 2424, "1644": 2425, "1374": 2426, "4800": 2427, "614": 2428, "1591": 2429, "289": 2430, "8455": 2431, "297": 2432, "1041": 2433, "5785": 2434, "1914": 2435, "177": 2436, "1162": 2437, "1890": 2438, "866": 2439, "1127": 2440, "477": 2441, "1203": 2442, "1594": 2443, "999": 2444, "1285": 2445, "1030": 2446, "1370": 2447, "1770": 2448, "1073": 2449, "130": 2450, "1074": 2451, "4080": 2452, "1362": 2453, "3306": 2454, "1904": 2455, "7626": 2456, "1588": 2457, "226": 2458, "857": 2459, "1505": 2460, "256": 2461, "1337": 2462, "7055": 2463, "291": 2464, "198": 2465, "320": 2466, "137": 2467, "3861": 2468, "519": 2469, "1187": 2470, "2025": 2471, "915": 2472, "1467": 2473, "1881": 2474, "2744": 2475, "513": 2476, "1035": 2477, "1112": 2478, "378": 2479, "530": 2480, "533": 2481, "387": 2482, "1365": 2483, "1500": 2484, "1208": 2485, "981": 2486, "415": 2487, "1270": 2488, "4408": 2489, "208": 2490, "1415": 2491, "1410": 2492, "675": 2493, "133": 2494, "5978": 2495, "7050": 2496, "2368": 2497, "696": 2498, "1102": 2499, "4500": 2500, "651": 2501, "1638": 2502, "936": 2503, "948": 2504, "1562": 2505, "623": 2506, "1346": 2507, "792": 2508, "1631": 2509, "449": 2510, "870": 2511, "1542": 2512, "2550": 2513, "790": 2514, "5254": 2515, "3723": 2516, "179": 2517, "453": 2518, "1442": 2519, "1331": 2520, "1135": 2521, "1463": 2522, "1140": 2523, "234": 2524, "692": 2525, "2520": 2526, "1719": 2527, "131": 2528, "1608": 2529, "1449": 2530, "4717": 2531, "1168": 2532, "1738": 2533, "1460": 2534, "101": 2535, "833": 2536, "1053": 2537, "342": 2538, "6622": 2539, "1254": 2540, "5590": 2541, "5694": 2542, "1064": 2543, "455": 2544, "240": 2545, "917": 2546, "1478": 2547, "1859": 2548, "6141": 2549, "6561": 2550, "1716": 2551, "5390": 2552, "561": 2553, "568": 2554, "3692": 2555, "1072": 2556, "1601": 2557, "6460": 2558, "186": 2559, "1938": 2560, "155": 2561, "547": 2562, "1180": 2563, "749": 2564, "481": 2565, "185": 2566, "666": 2567, "861": 2568, "1517": 2569, "1787": 2570, "1541": 2571, "681": 2572, "894": 2573, "3393": 2574, "961": 2575, "795": 2576, "817": 2577, "562": 2578, "5487": 2579, "543": 2580, "2277": 2581, "509": 2582, "574": 2583, "206": 2584, "1513": 2585, "4154": 2586, "1156": 2587, "5035": 2588, "978": 2589, "3612": 2590, "1067": 2591, "3249": 2592, "446": 2593, "2294": 2594, "1137": 2595, "1765": 2596, "827": 2597, "693": 2598, "2915": 2599, "578": 2600, "2492": 2601, "1438": 2602, "6308": 2603, "173": 2604, "485": 2605, "1076": 2606, "541": 2607, "460": 2608, "214": 2609, "757": 2610, "5628": 2611, "235": 2612, "7031": 2613, "1146": 2614, "4067": 2615, "909": 2616, "203": 2617, "715": 2618, "1486": 2619, "3100": 2620, "1307": 2621, "1267": 2622, "187": 2623, "1387": 2624, "3003": 2625, "735": 2626, "1516": 2627, "1227": 2628, "7695": 2629, "1207": 2630, "3901": 2631, "977": 2632, "450": 2633, "1998": 2634, "4674": 2635, "1559": 2636, "1276": 2637, "708": 2638, "1372": 2639, "1183": 2640, "3627": 2641, "1384": 2642, "2912": 2643, "683": 2644, "716": 2645, "165": 2646, "1161": 2647, "3484": 2648, "626": 2649, "1320": 2650, "1248": 2651, "1848": 2652, "912": 2653, "2870": 2654, "5616": 2655, "1199": 2656, "1040": 2657, "287": 2658, "1026": 2659, "803": 2660, "507": 2661, "776": 2662, "280": 2663, "1210": 2664, "1620": 2665, "318": 2666, "6840": 2667, "1717": 2668, "700": 2669, "504": 2670, "2378": 2671, "2684": 2672, "1568": 2673, "1046": 2674, "1393": 2675, "6888": 2676, "1058": 2677, "1813": 2678, "898": 2679, "1595": 2680, "6192": 2681, "1360": 2682, "5037": 2683, "1477": 2684, "1404": 2685, "1369": 2686, "711": 2687, "1656": 2688, "1126": 2689, "160": 2690, "263": 2691, "277": 2692, "1613": 2693, "2706": 2694, "475": 2695, "5700": 2696, "816": 2697, "1196": 2698, "4290": 2699, "688": 2700, "1290": 2701, "2024": 2702, "871": 2703, "7954": 2704, "478": 2705, "391": 2706, "787": 2707, "1228": 2708, "766": 2709, "337": 2710, "1686": 2711, "9207": 2712, "8712": 2713, "662": 2714, "1643": 2715, "1420": 2716, "2241": 2717, "593": 2718, "1382": 2719, "647": 2720, "609": 2721, "1427": 2722, "8084": 2723, "2619": 2724, "343": 2725, "947": 2726, "498": 2727, "313": 2728, "496": 2729, "242": 2730, "1089": 2731, "1348": 2732, "2037": 2733, "2849": 2734, "1466": 2735, "4092": 2736, "1068": 2737, "2460": 2738, "1271": 2739, "3026": 2740, "4661": 2741, "353": 2742, "4288": 2743, "468": 2744, "919": 2745, "1960": 2746, "508": 2747, "659": 2748, "6003": 2749, "5264": 2750, "914": 2751, "1152": 2752, "1980": 2753, "119": 2754, "1299": 2755, "459": 2756, "1749": 2757, "3552": 2758, "1302": 2759, "4029": 2760, "4914": 2761, "1654": 2762, "2968": 2763, "5022": 2764, "612": 2765, "1213": 2766, "2814": 2767, "604": 2768, "1587": 2769, "654": 2770, "1590": 2771, "748": 2772, "6912": 2773, "1364": 2774, "1066": 2775, "2640": 2776, "6789": 2777, "166": 2778, "1496": 2779, "3645": 2780, "515": 2781, "3432": 2782, "4256": 2783, "877": 2784, "1358": 2785, "1288": 2786, "121": 2787, "1051": 2788, "359": 2789, "1630": 2790, "1280": 2791, "175": 2792, "463": 2793, "1725": 2794, "1885": 2795, "3880": 2796, "7144": 2797, "1193": 2798, "7224": 2799, "1201": 2800, "3876": 2801, "434": 2802, "6545": 2803, "3526": 2804, "3906": 2805, "4761": 2806, "1556": 2807, "3038": 2808, "994": 2809, "1599": 2810, "3870": 2811, "6956": 2812, "1552": 2813, "2340": 2814, "2604": 2815, "136": 2816, "4872": 2817, "1192": 2818, "2009": 2819, "691": 2820, "6208": 2821, "1363": 2822, "1144": 2823, "2760": 2824, "642": 2825, "1198": 2826, "695": 2827, "615": 2828, "822": 2829, "1564": 2830, "1336": 2831, "3240": 2832, "4277": 2833, "1435": 2834, "6510": 2835, "1598": 2836, "1310": 2837, "1283": 2838, "1714": 2839, "1087": 2840, "929": 2841, "1390": 2842, "596": 2843, "4400": 2844, "1293": 2845, "362": 2846, "516": 2847, "4250": 2848, "355": 2849, "1456": 2850, "462": 2851, "1008": 2852, "2574": 2853, "315": 2854, "6390": 2855, "887": 2856, "336": 2857, "1321": 2858, "2584": 2859, "1777": 2860, "1322": 2861, "2940": 2862, "1047": 2863, "1262": 2864, "1345": 2865, "2296": 2866, "479": 2867, "447": 2868, "435": 2869, "1413": 2870, "740": 2871, "1049": 2872, "5336": 2873, "618": 2874, "7568": 2875, "788": 2876, "170": 2877, "1846": 2878, "2291": 2879, "1151": 2880, "1313": 2881, "1344": 2882, "1113": 2883, "771": 2884, "4850": 2885, "1600": 2886, "7743": 2887, "8648": 2888, "1088": 2889, "4128": 2890, "5120": 2891, "6862": 2892, "3060": 2893, "1124": 2894, "1166": 2895, "1231": 2896, "4686": 2897, "1900": 2898, "1257": 2899, "5236": 2900, "4472": 2901, "629": 2902, "399": 2903, "1811": 2904, "1586": 2905, "2964": 2906, "145": 2907, "1880": 2908, "4450": 2909, "1007": 2910, "8722": 2911, "1495": 2912, "2205": 2913, "1538": 2914, "1820": 2915, "1412": 2916, "1269": 2917, "1457": 2918, "150": 2919, "1266": 2920, "1118": 2921, "3186": 2922, "1626": 2923, "3150": 2924, "5612": 2925, "7968": 2926, "5106": 2927, "3311": 2928, "1705": 2929, "2170": 2930, "2209": 2931, "903": 2932, "1849": 2933, "4374": 2934, "6552": 2935, "3894": 2936, "3774": 2937, "3245": 2938, "4160": 2939, "8526": 2940, "6305": 2941, "1507": 2942, "1333": 2943, "1025": 2944, "2862": 2945, "3024": 2946, "1919": 2947, "3102": 2948, "1214": 2949, "7650": 2950, "5621": 2951, "4464": 2952, "3458": 2953, "1553": 2954, "377": 2955, "373": 2956, "5605": 2957, "1468": 2958, "1129": 2959, "7857": 2960, "7614": 2961, "777": 2962, "1695": 2963, "2449": 2964, "1794": 2965, "1619": 2966, "2387": 2967, "1260": 2968, "4992": 2969, "437": 2970, "3408": 2971, "5460": 2972, "1132": 2973, "3198": 2974, "769": 2975, "1704": 2976, "1432": 2977, "1566": 2978, "684": 2979, "1815": 2980, "6320": 2981, "4089": 2982, "891": 2983, "1606": 2984, "753": 2985, "1579": 2986, "5040": 2987, "1324": 2988, "1275": 2989, "1048": 2990, "5100": 2991, "3956": 2992, "3944": 2993, "1680": 2994, "4644": 2995, "4224": 2996, "494": 2997, "1206": 2998, "1186": 2999, "7298": 3000, "1549": 3001, "1015": 3002, "3465": 3003, "1069": 3004, "2752": 3005, "1584": 3006, "746": 3007, "4158": 3008, "1019": 3009, "1294": 3010, "1255": 3011, "3196": 3012, "2655": 3013, "5655": 3014, "2257": 3015, "1263": 3016, "1650": 3017, "526": 3018, "1061": 3019, "1209": 3020, "1795": 3021, "9603": 3022, "1090": 3023, "491": 3024, "801": 3025, "135": 3026, "1147": 3027, "2613": 3028, "4004": 3029, "1984": 3030, "4324": 3031, "1289": 3032, "8280": 3033, "2886": 3034, "2656": 3035, "4182": 3036, "1603": 3037, "1268": 3038, "1957": 3039, "1978": 3040, "7395": 3041, "2793": 3042, "361": 3043, "1635": 3044, "4284": 3045, "6734": 3046, "7227": 3047, "374": 3048, "7216": 3049, "4698": 3050, "1520": 3051, "6806": 3052, "371": 3053, "1169": 3054, "6016": 3055, "1416": 3056, "4345": 3057, "6873": 3058, "107": 3059, "1926": 3060, "1375": 3061, "4774": 3062, "327": 3063, "305": 3064, "3648": 3065, "6424": 3066, "1423": 3067, "469": 3068, "2064": 3069, "2496": 3070, "1540": 3071, "1453": 3072, "1802": 3073, "4558": 3074, "1851": 3075, "1243": 3076, "3969": 3077, "1395": 3078, "1356": 3079, "370": 3080, "1234": 3081, "124": 3082, "4960": 3083, "1226": 3084, "1303": 3085, "2392": 3086, "3230": 3087, "2059": 3088, "1326": 3089, "5986": 3090, "7029": 3091, "122": 3092, "221": 3093, "1176": 3094, "1512": 3095, "1122": 3096, "1351": 3097, "1473": 3098, "4440": 3099, "253": 3100, "3948": 3101, "4136": 3102, "2772": 3103, "1045": 3104, "2100": 3105, "1439": 3106, "6966": 3107, "4720": 3108, "3068": 3109, "6402": 3110, "3584": 3111, "1475": 3112, "1157": 3113, "123": 3114, "162": 3115, "1647": 3116, "6624": 3117, "1547": 3118, "1454": 3119, "4620": 3120, "2842": 3121, "3619": 3122, "1239": 3123, "1143": 3124, "2350": 3125, "8091": 3126, "3840": 3127, "4272": 3128, "3666": 3129, "2365": 3130, "1535": 3131, "1474": 3132, "4416": 3133, "4898": 3134, "1532": 3135, "1325": 3136, "5626": 3137, "4012": 3138, "2745": 3139, "1589": 3140, "1218": 3141, "6370": 3142, "1743": 3143, "4316": 3144, "2923": 3145, "4422": 3146, "1537": 3147, "4539": 3148, "1762": 3149, "5429": 3150, "928": 3151, "1448": 3152, "2555": 3153, "169": 3154, "1694": 3155, "6110": 3156, "5940": 3157, "5964": 3158, "1546": 3159, "1405": 3160, "2220": 3161, "1888": 3162, "2337": 3163, "1672": 3164, "6958": 3165, "2044": 3166, "2639": 3167, "958": 3168, "1655": 3169, "1459": 3170, "1610": 3171, "1663": 3172, "1465": 3173, "1489": 3174, "4042": 3175, "5490": 3176, "1338": 3177, "2262": 3178, "1581": 3179, "2120": 3180, "1773": 3181, "7350": 3182, "2090": 3183, "7098": 3184, "1720": 3185, "7225": 3186, "1032": 3187, "278": 3188, "4320": 3189, "8036": 3190, "4896": 3191, "3132": 3192, "1707": 3193, "4425": 3194, "3456": 3195, "1806": 3196, "2813": 3197, "1909": 3198, "1408": 3199, "1651": 3200, "3128": 3201, "2124": 3202, "1389": 3203, "3182": 3204, "3078": 3205, "114": 3206, "5104": 3207, "1086": 3208, "6132": 3209, "5074": 3210, "1237": 3211, "3680": 3212, "3213": 3213, "4399": 3214, "1258": 3215, "1519": 3216, "1688": 3217, "6699": 3218, "1724": 3219, "5200": 3220, "5580": 3221, "5073": 3222, "8360": 3223, "1659": 3224, "2256": 3225, "1573": 3226, "1031": 3227, "3965": 3228, "3116": 3229, "6106": 3230, "1742": 3231, "2408": 3232, "1189": 3233, "3960": 3234, "3888": 3235, "1968": 3236, "3402": 3237, "1786": 3238, "1583": 3239, "1160": 3240, "1887": 3241, "1252": 3242, "3154": 3243, "1551": 3244, "6237": 3245, "1224": 3246, "6630": 3247, "189": 3248, "1711": 3249, "1726": 3250, "1718": 3251, "2552": 3252, "1721": 3253, "1963": 3254, "3234": 3255, "1640": 3256, "1800": 3257, "1673": 3258, "1550": 3259, "1555": 3260, "5610": 3261, "3248": 3262, "1240": 3263, "3828": 3264, "2673": 3265, "5304": 3266, "2576": 3267, "4828": 3268, "1082": 3269, "2759": 3270, "356": 3271, "3528": 3272, "4680": 3273, "1138": 3274, "1860": 3275, "1407": 3276, "6642": 3277, "5184": 3278, "1222": 3279, "5124": 3280, "1116": 3281, "1853": 3282, "1077": 3283, "3822": 3284, "3485": 3285, "6164": 3286, "4130": 3287, "7821": 3288, "3630": 3289, "7566": 3290, "1134": 3291, "2960": 3292, "3080": 3293, "2058": 3294, "4144": 3295, "1766": 3296, "1062": 3297, "1709": 3298, "2250": 3299, "1197": 3300, "1506": 3301, "2916": 3302, "1100": 3303, "2010": 3304, "1902": 3305, "1702": 3306, "4508": 3307, "5795": 3308, "3686": 3309, "2419": 3310, "3363": 3311, "1462": 3312, "1827": 3313, "1471": 3314, "1301": 3315, "3738": 3316, "1422": 3317, "3162": 3318, "1070": 3319, "2268": 3320, "2030": 3321, "2050": 3322, "6885": 3323, "2988": 3324, "2635": 3325, "6696": 3326, "458": 3327, "4140": 3328, "1597": 3329, "4830": 3330, "1628": 3331, "2596": 3332, "3690": 3333, "1114": 3334, "5925": 3335, "1582": 3336, "4085": 3337, "6930": 3338, "3264": 3339, "3243": 3340, "1480": 3341, "6480": 3342, "5280": 3343, "2040": 3344, "2156": 3345, "3380": 3346, "1750": 3347, "1634": 3348, "1308": 3349, "4366": 3350, "1492": 3351, "3094": 3352, "1217": 3353, "193": 3354, "1080": 3355, "4606": 3356, "2881": 3357, "4032": 3358, "1029": 3359, "3410": 3360, "1098": 3361, "1099": 3362, "1386": 3363, "1184": 3364, "1238": 3365, "7776": 3366, "4884": 3367, "5096": 3368, "976": 3369, "167": 3370, "1596": 3371, "3844": 3372, "1093": 3373, "3655": 3374, "2535": 3375, "4590": 3376, "3717": 3377, "3895": 3378, "3354": 3379, "6900": 3380, "3127": 3381, "1891": 3382, "3492": 3383, "6072": 3384, "1639": 3385, "1018": 3386, "4704": 3387, "6435": 3388, "3854": 3389, "3995": 