{"<pad>": 0, "<start>": 1, "<end>": 2, "<unk>": 3, "word_map_coef": 4, "ques:": 4, "What": 5, "is": 6, "photosynthesis?": 7, "ans:": 8, "Photosynthesis": 9, "the": 10, "process": 11, "by": 12, "which": 13, "plants,": 14, "algae,": 15, "and": 16, "some": 17, "bacteria": 18, "convert": 19, "sunlight": 20, "into": 21, "chemical": 22, "energy.": 23, "Using": 24, "carbon": 25, "dioxide,": 26, "water,": 27, "light": 28, "energy,": 29, "these": 30, "organisms": 31, "produce": 32, "glucose": 33, "release": 34, "oxygen": 35, "as": 36, "a": 37, "byproduct.": 38, "This": 39, "forms": 40, "foundation": 41, "of": 42, "most": 43, "food": 44, "chains": 45, "supplies": 46, "necessary": 47, "for": 48, "life": 49, "on": 50, "Earth.": 51, "Great": 52, "Wall": 53, "China?": 54, "The": 55, "China": 56, "series": 57, "defensive": 58, "structures": 59, "built": 60, "over": 61, "several": 62, "centuries": 63, "to": 64, "protect": 65, "Chinese": 66, "states": 67, "from": 68, "invasions.": 69, "Stretching": 70, "21,000": 71, "kilometers,": 72, "it": 73, "represents": 74, "one": 75, "ambitious": 76, "construction": 77, "projects": 78, "in": 79, "human": 80, "history.": 81, "was": 82, "Industrial": 83, "Revolution?": 84, "Revolution": 85, "major": 86, "period": 87, "transformation": 88, "that": 89, "began": 90, "late": 91, "18th": 92, "century.": 93, "It": 94, "marked": 95, "shift": 96, "manual": 97, "labor": 98, "machine-based": 99, "manufacturing,": 100, "leading": 101, "urbanization": 102, "technological": 103, "innovation.": 104, "While": 105, "increased": 106, "productivity": 107, "economic": 108, "growth,": 109, "also": 110, "introduced": 111, "social": 112, "challenges": 113, "such": 114, "pollution": 115, "exploitation.": 116, "gravity?": 117, "Gravity": 118, "fundamental": 119, "force": 120, "nature": 121, "causes": 122, "objects": 123, "with": 124, "mass": 125, "attract": 126, "another.": 127, "On": 128, "Earth,": 129, "gravity": 130, "keeps": 131, "people": 132, "grounded": 133, "governs": 134, "motion": 135, "planets,": 136, "moons,": 137