{
  "<pad>": 0,
  "<start>": 1,
  "<end>": 2,
  "<unk>": 3,
  "ques:": 4,
  "What": 5,
  "is": 6,
  "photosynthesis?": 7,
  "ans:": 8,
  "Photosynthesis": 9,
  "the": 10,
  "process": 11,
  "by": 12,
  "which": 13,
  "plants,": 14,
  "algae,": 15,
  "and": 16,
  "some": 17,
  "bacteria": 18,
  "convert": 19,
  "sunlight": 20,
  "into": 21,
  "chemical": 22,
  "energy.": 23,
  "Using": 24,
  "carbon": 25,
  "dioxide,": 26,
  "water,": 27,
  "light": 28,
  "energy,": 29,
  "these": 30,
  "organisms": 31,
  "produce": 32,
  "glucose": 33,
  "release": 34,
  "oxygen": 35,
  "as": 36,
  "a": 37,
  "byproduct.": 38,
  "This": 39,
  "forms": 40,
  "foundation": 41,
  "of": 42,
  "most": 43,
  "food": 44,
  "chains": 45,
  "supplies": 46,
  "necessary": 47,
  "for": 48,
  "life": 49,
  "on": 50,
  "Earth.": 51,
  "Great": 52,
  "Wall": 53,
  "China?": 54,
  "The": 55,
  "China": 56,
  "series": 57,
  "defensive": 58,
  "structures": 59,
  "built": 60,
  "over": 61,
  "several": 62,
  "centuries": 63,
  "to": 64,
  "protect": 65,
  "Chinese": 66,
  "states": 67,
  "from": 68,
  "invasions.": 69,
  "Stretching": 70,
  "21,000": 71,
  "kilometers,": 72,
  "it": 73,
  "represents": 74,
  "one": 75,
  "ambitious": 76,
  "construction": 77,
  "projects": 78,
  "in": 79,
  "human": 80,
  "history.": 81,
  "was": 82,
  "Industrial": 83,
  "Revolution?": 84,
  "Revolution": 85,
  "major": 86,
  "period": 87,
  "transformation": 88,
  "that": 89,
  "began": 90,
  "late": 91,
  "18th": 92,
  "century.": 93,
  "It": 94,
  "marked": 95,
  "shift": 96,
  "manual": 97,
  "labor": 98,
  "machine-based": 99,
  "manufacturing,": 100,
  "leading": 101,
  "urbanization": 102,
  "technological": 103,
  "innovation.": 104,
  "While": 105,
  "increased": 106,
  "productivity": 107,
  "economic": 108,
  "growth,": 109,
  "also": 110,
  "introduced": 111,
  "social": 112,
  "challenges": 113,
  "such": 114,
  "pollution": 115,
  "exploitation.": 116,
  "gravity?": 117,
  "Gravity": 118,
  "fundamental": 119,
  "force": 120,
  "nature": 121,
  "causes": 122,
  "objects": 123,
  "with": 124,
  "mass": 125,
  "attract": 126,
  "another.": 127,
  "On": 128,
  "Earth,": 129,
  "gravity": 130,
  "keeps": 131,
  "people": 132,
  "grounded": 133,
  "governs": 134,
  "motion": 135,
  "planets,": 136,
  "moons,": 137,
  "stars": 138,
  "throughout": 139,
  "universe.": 140,
  "Without": 141,
  "gravity,": 142,
  "structure": 143,
  "galaxies": 144,
  "planetary": 145,
  "systems": 146,
  "would": 147,
  "not": 148,
  "exist.": 149,
  "longest": 150,
  "river": 151,
  "world?": 152,
  "world": 153,
  "generally": 154,
  "considered": 155,
  "be": 156,
  "Amazon": 157,
  "River": 158,
  "South": 159,
  "America.": 160,
  "flows": 161,
  "through": 162,
  "multiple": 163,
  "countries": 164,
  "including": 165,
  "Peru,": 166,
  "Colombia,": 167,
  "Brazil,": 168,
  "stretches": 169,
  "approximately": 170,
  "6,400": 171,
  "kilometers.": 172,
  "powerful": 173,
  "volume,": 174,
  "releasing": 175,
  "more": 176,
  "freshwater": 177,
  "ocean": 178,
  "than": 179,
  "any": 180,
  "other": 181,
  "system.": 182,
  "Its": 183,
  "basin": 184,
  "supports": 185,
  "Rainforest,": 186,
  "plays": 187,
  "vital": 188,
  "role": 189,
  "regulating": 190,
  "global": 191,
  "climate": 192,
  "supporting": 193,
  "biodiversity.": 194,
  "artificial": 195,
  "intelligence?": 196,
  "Artificial": 197,
  "intelligence": 198,
  "refers": 199,
  "computer": 200,
  "designed": 201,
  "perform": 202,
  "tasks": 203,
  "normally": 204,
  "require": 205,
  "intelligence.": 206,
  "These": 207,
  "include": 208,
  "learning,": 209,
  "problem-solving,": 210,
  "language": 211,
  "understanding,": 212,
  "decision-making.": 213,
  "AI": 214,
  "widely": 215,
  "used": 216,
  "healthcare,": 217,
  "finance,": 218,
  "transportation,": 219,
  "many": 220,
  "industries.": 221,
  "largest": 222,
  "desert": 223,
  "Earth?": 224,
  "Earth": 225,
  "Antarctica,": 226,
  "classified": 227,
  "cold": 228,
  "due": 229,
  "its": 230,
  "extremely": 231,
  "low": 232,
  "precipitation": 233,
  "levels.": 234,
  "Although": 235,
  "covered": 236,
  "ice": 237,
  "rather": 238,
  "sand,": 239,
  "meets": 240,
  "scientific": 241,
  "definition": 242,
  "because": 243,
  "receives": 244,
  "very": 245,
  "little": 246,
  "snowfall.": 247,
  "Antarctica": 248,
  "crucial": 249,
  "Earth's": 250,
  "currents.": 251,
  "Internet?": 252,
  "Internet": 253,
  "network": 254,
  "interconnected": 255,
  "computers": 256,
  "allows": 257,
  "share": 258,
  "information": 259,
  "communicate": 260,
  "instantly.": 261,
  "has": 262,
  "transformed": 263,
  "education,": 264,
  "business,": 265,
  "entertainment,": 266,
  "interaction,": 267,
  "becoming": 268,
  "central": 269,
  "part": 270,
  "modern": 271,
  "life.": 272,
  "precipitation.": 273,
  "Despite": 274,
  "being": 275,
  "ice,": 276,
  "desert.": 277,
  "temperature": 278,
  "circulation.": 279,
  "rapid": 280,
  "industrial": 281,
  "change": 282,
  "beginning": 283,
  "machine": 284,
  "factories,": 285,
  "urbanization.": 286,
  "productivity,": 287,
  "created": 288,
  "environmental": 289,
  "challenges.": 290,
  "vast": 291,
  "states.": 292,
  "stands": 293,
  "symbol": 294,
  "historical": 295,
  "engineering": 296,
  "achievement.": 297,
  "communication": 298,
  "connecting": 299,
  "billions": 300,
  "devices": 301,
  "worldwide.": 302,
  "enables": 303,
  "instant": 304,
  "exchange": 305,
  "interaction.": 306,
  "dioxide": 307,
  "oxygen.": 308,
  "ecosystems": 309,
  "attracts": 310,
  "toward": 311,
  "each": 312,
  "other.": 313,
  "motion,": 314,
  "together,": 315,
  "exist": 316,
  "holding": 317,
  "atmosphere": 318,
  "oceans": 319,
  "place.": 320,
  "machines": 321,
  "simulate": 322,
  "can": 323,
  "learn": 324,
  "data,": 325,
  "recognize": 326,
  "patterns,": 327,
  "make": 328,
  "decisions,": 329,
  "playing": 330,
  "growing": 331,
  "technology": 332,
  "industry.": 333,
  "Brazil": 334,
  "Beyond": 335,
  "length,": 336,
  "carries": 337,
  "water": 338,
  "system": 339,
  "important": 340,
  "regulation.": 341,
  "Hello": 342,
  "!": 343,
  "@": 344,
  "#": 345,
  "$": 346,
  "%": 347,
  "^": 348,
  "&": 349,
  "*": 350,
  "(": 351,
  ")": 352,
  "_": 353,
  "+": 354,
  "-": 355,
  "=": 356,
  "[": 357,
  "]": 358,
  "{": 359,
  "}": 360,
  "|": 361,
  "\\": 362,
  ":": 363,
  ";": 364,
  "\u201d": 365,
  "\u201c": 366,
  "\u2018": 367,
  "\u2019": 368,
  "<": 369,
  ">": 370,
  ",": 371,
  ".": 372,
  "?": 373,
  "/": 374,
  "~": 375,
  "`": 376,
  "ques": 377,
  "photosynthesis": 378,
  "ans": 379,
  "plants": 380,
  "algae": 381,
  "energy": 382,
  "byproduct": 383,
  "invasions": 384,
  "21": 385,
  "000": 386,
  "kilometers": 387,
  "history": 388,
  "century": 389,
  "based": 390,
  "manufacturing": 391,
  "innovation": 392,
  "growth": 393,
  "exploitation": 394,
  "another": 395,
  "planets": 396,
  "moons": 397,
  "universe": 398,
  "America": 399,
  "Peru": 400,
  "Colombia": 401,
  "6": 402,
  "400": 403,
  "volume": 404,
  "Rainforest": 405,
  "biodiversity": 406,
  "learning": 407,
  "problem": 408,
  "solving": 409,
  "understanding": 410,
  "decision": 411,
  "making": 412,
  "healthcare": 413,
  "finance": 414,
  "transportation": 415,
  "industries": 416,
  "levels": 417,
  "sand": 418,
  "snowfall": 419,
  "currents": 420,
  "instantly": 421,
  "education": 422,
  "business": 423,
  "entertainment": 424,
  "interaction": 425,
  "word_map_coef": 426
}