{"<pad>": 0, "<start>": 1, "<end>": 2, "<unk>": 3, "ques:": 2756873, "What": 2756874, "is": 2756918, "photosynthesis?": 2756728, "ans:": 2756882, "Photosynthesis": 2756730, "the": 2756940, "process": 2756764, "by": 2756924, "which": 2756943, "plants,": 2756736, "algae,": 2756737, "and": 2756952, "some": 2756739, "bacteria": 2756740, "convert": 2756741, "sunlight": 2756742, "into": 2756929, "chemical": 2756744, "energy.": 2756745, "Using": 2756746, "carbon": 2756747, "dioxide,": 2756748, "water,": 2756749, "light": 2756751, "energy,": 2756752, "these": 2756753, "organisms": 2756754, "produce": 2756755, "glucose": 2756756, "release": 2756758, "oxygen": 2756775, "as": 2756760, "a": 2756945, "byproduct.": 2756762, "This": 2756763, "forms": 2756765, "foundation": 2756767, "of": 2756864, "most": 2756921, "food": 2756770, "chains": 2756771, "supplies": 2756773, "necessary": 2756776, "for": 2756912, "life": 2756778, "on": 2756779, "Earth.": 2756780, "Great": 2756837, "Wall": 2756838, "China?": 2756834, "The": 2756916, "China": 2756840, "series": 2756843, "defensive": 2756845, "structures": 2756846, "built": 2756847, "over": 2756858, "several": 2756849, "centuries": 2756850, "to": 2756892, "protect": 2756852, "Chinese": 2756853, "states": 2756854, "from": 2756855, "invasions.": 2756856, "Stretching": 2756857, "21,000": 2756859, "kilometers,": 2756860, "it": 2756861, "represents": 2756862, "one": 2756863, "ambitious": 2756867, "construction": 2756868, "projects": 2756869, "in": 2756948, "human": 2756871, "history.": 2756872, "was": 2756407, "Industrial": 2756405, "Revolution?": 2756402, "Revolution": 2756406, "major": 2756409, "period": 2756410, "transformation": 2756412, "that": 2756634, "began": 2756414, "late": 2756417, "18th": 2756418, "century.": 2756419, "It": 2756900, "marked": 2756421, "shift": 2756423, "manual": 2756425, "labor": 2756452, "machine-based": 2756428, "manufacturing,": 2756429, "leading": 2756430, "urbanization": 2756432, "technological": 2756434, "innovation.": 2756435, "While": 2756436, "increased": 2756438, "productivity": 2756439, "economic": 2756441, "growth,": 2756442, "also": 2756919, "introduced": 2756445, "social": 2756485, "challenges": 2756447, "such": 2756448, "pollution": 2756450, "exploitation.": 2756453, "gravity?": 2756347, "Gravity": 2756349, "fundamental": 2756352, "force": 2756353, "nature": 2756355, "causes": 2756357, "objects": 2756371, "with": 2756359, "mass": 2756360, "attract": 2756362, "another.": 2756364, "On": 2756365, "Earth,": 2756366, "gravity": 2756367, "keeps": 2756368, "people": 2756471, "grounded": 2756372, "governs": 2756374, "motion": 2756376, "planets,": 2756378, "moons,": 2756379, "stars": 2756381, "throughout": 2756382, "universe.": 2756384, "Without": 2756385, "gravity,": 2756386, "structure": 2756388, "galaxies": 2756390, "planetary": 2756392, "systems": 2756629, "would": 2756394, "not": 2756395, "exist.": 2756396, "longest": 2756884, "river": 2756935, "world?": 2756881, "world": 2756888, "generally": 2756890, "considered": 2756891, "be": 2756893, "Amazon": 2756941, "River": 2756896, "South": 2756898, "America.": 2756899, "flows": 2756901, "through": 2756902, "multiple": 2756903, "countries": 2756904, "including": 2756905, "Peru,": 2756906, "Colombia,": 2756907, "Brazil,": 2756909, "stretches": 2756911, "approximately": 2756913, "6,400": 2756914, "kilometers.": 2756915, "powerful": 2756922, "volume,": 2756925, "releasing": 2756926, "more": 2756927, "freshwater": 2756928, "ocean": 2756931, "than": 2756932, "any": 2756933, "other": 2756934, "system.": 2756936, "Its": 2756937, "basin": 2756938, "supports": 2756939, "Rainforest,": 2756942, "plays": 2756944, "vital": 2756946, "role": 2756947, "regulating": 2756949, "global": 2756950, "climate": 2756951, "supporting": 2756953, "biodiversity.": 2756954, "artificial": 2756621, "intelligence?": 2756622, "Artificial": 2756624, "intelligence": 2756625, "refers": 2756626, "computer": 2756628, "designed": 2756630, "perform": 2756632, "tasks": 2756640, "normally": 2756635, "require": 2756636, "intelligence.": 2756638, "These": 2756639, "include": 2756641, "learning,": 2756642, "problem-solving,": 2756643, "language": 2756644, "understanding,": 2756645, "decision-making.": 2756647, "AI": 2756648, "widely": 2756650, "used": 2756651, "healthcare,": 2756653, "finance,": 2756654, "transportation,": 2756655, "many": 2756657, "industries.": 2756659, "largest": 2756670, "desert": 2756706, "Earth?": 2756667, "Earth": 2756673, "Antarctica,": 2756675, "classified": 2756678, "cold": 2756681, "due": 2756683, "its": 2756685, "extremely": 2756686, "low": 2756687, "precipitation": 2756688, "levels.": 2756689, "Although": 2756690, "covered": 2756693, "ice": 2756695, "rather": 2756696, "sand,": 2756698, "meets": 2756700, "scientific": 2756702, "definition": 2756703, "because": 2756707, "receives": 2756709, "very": 2756710, "little": 2756711, "snowfall.": 2756712, "Antarctica": 2756713, "crucial": 2756716, "Earth's": 2756720, "currents.": 2756724, "Internet?": 2756458, "Internet": 2756461, "network": 2756465, "interconnected": 2756467, "computers": 2756468, "allows": 2756470, "share": 2756473, "information": 2756474, "communicate": 2756476, "instantly.": 2756477, "has": 2756479, "transformed": 2756480, "education,": 2756481, "business,": 2756482, "entertainment,": 2756483, "interaction,": 2756486, "becoming": 2756487, "central": 2756489, "part": 2756490, "modern": 2756492, "life.": 2756493, "vast": 2207955, "states.": 2207964, "stands": 2207971, "symbol": 2207974, "historical": 2207976, "engineering": 2207977, "achievement.": 2207978, "precipitation.": 2207687, "Despite": 2207688, "being": 2207689, "ice,": 2207692, "desert.": 2207700, "temperature": 2207709, "circulation.": 2207712, "dioxide": 2208001, "oxygen.": 2208010, "ecosystems": 2208018, "attracts": 2207588, "toward": 2207592, "each": 2207593, "other.": 2207594, "motion,": 2207598, "together,": 2207601, "exist": 2207606, "holding": 2207610, "atmosphere": 2207612, "oceans": 2207614, "place.": 2207616, "communication": 2207769, "connecting": 2207771, "billions": 2207772, "devices": 2207774, "worldwide.": 2207775, "enables": 2207777, "instant": 2207778, "exchange": 2207780, "interaction.": 2207788, "Brazil": 2207864, "Beyond": 2207869, "length,": 2207871, "carries": 2207874, "water": 2207876, "system": 2207881, "important": 2207893, "regulation.": 2207898, "rapid": 2208038, "industrial": 2208039, "change": 2208042, "beginning": 2208043, "machine": 2208050, "factories,": 2208052, "urbanization.": 2208054, "productivity,": 2208058, "created": 2208061, "environmental": 2208064, "challenges.": 2208065, "machines": 2207511, "simulate": 2207514, "can": 2207519, "learn": 2207520, "data,": 2207522, "recognize": 2207523, "patterns,": 2207524, "make": 2207526, "decisions,": 2207527, "playing": 2207528, "growing": 2207530, "technology": 2207534, "industry.": 2207536}